## Final Project Submission

Please fill out:
* Student name:Lee Kimaita 
* Student pace: Part time
* Scheduled project review date/time: 
* Instructor name: Diana Mong'ina
* Blog post URL:

# Project Overview
The film industry is among a multi-billion dollar venture by numerous companies. Microsoft company has deemed it essential to ensure that they derive meaningful data from the available data from currently available video content in a bid to create a new studio. This analysis has put into use exploratory data to generate insights for the business stakeholders. Data has been cleaned and analysed.

# Business Problem
Microsoft company seeks to create a competitive advantage in the film industry by establishing an ultra-modern, state of the art and futuristic movie studio. It seeks to be the giant and most preferred movie studio of choice by entertainment seekers with minimal competition from other key film players. Thus, we look at the various best film genres in the industry to help draw insights on the most profitable and marketable venture.

# Data Understanding
Microsoft does not currently have any data relating to the multi-billion dollar industry. The available data from the industry has the best film genres that the company can venture into. The dataset available includes; genres, budgets and grossings (domestic and worldwide).

# Importing Packages & Libraries

In [4]:
# Libraries to use

import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
import sqlite3

## Data from the budget

In [5]:
# importing movie budget data
tn_movies = pd.read_csv("zippedData/tn.movie_budgets.csv" , index_col = 0)
tn_movies

,release_date,movie,production_budget,domestic_gross,worldwide_gross
id,,,,,
1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
...,...,...,...,...,...
78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

## Cleaning budget data
In this section, we look for either duplicates or missing values. since data is available, we can assume that there is no missing data and choose to keep the first row or eliminate duplicates.

In [6]:
# identifying any missing data
tn_movies .isna().sum()

release_date         0
movie                0
production_budget    0
domestic_gross       0
worldwide_gross      0
dtype: int64

In [7]:
# identify any duplicates

tn_movies .duplicated().sum()

0

In [8]:
tn_movies.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5782 entries, 1 to 82
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   release_date       5782 non-null   object
 1   movie              5782 non-null   object
 2   production_budget  5782 non-null   object
 3   domestic_gross     5782 non-null   object
 4   worldwide_gross    5782 non-null   object
dtypes: object(5)
memory usage: 271.0+ KB

In [9]:
# choosing to eliminate signage ($ and ,) by converting to float

tn_movies ['production_budget'] = tn_movies ['production_budget'].str.replace('$', "").str.replace(',',"").astype(float)
tn_movies['domestic_gross']= tn_movies['domestic_gross'].str.replace('$', "").str.replace(',',"").astype(float)
tn_movies['worldwide_gross']= tn_movies['worldwide_gross'].str.replace('$', "").str.replace(',',"").astype(float)
tn_movies .head()

C:\Users\HP\AppData\Local\Temp\ipykernel_3876\3432895155.py:3: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  tn_movies ['production_budget'] = tn_movies ['production_budget'].str.replace('$', "").str.replace(',',"").astype(float)
C:\Users\HP\AppData\Local\Temp\ipykernel_3876\3432895155.py:4: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  tn_movies['domestic_gross']= tn_movies['domestic_gross'].str.replace('$', "").str.replace(',',"").astype(float)
C:\Users\HP\AppData\Local\Temp\ipykernel_3876\3432895155.py:5: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  tn_movies['worldwide_gross']= tn_movies['worldwide_gross'].str.replace('$', "").str.replace(',',"").astype(float)

,release_date,movie,production_budget,domestic_gross,worldwide_gross
id,,,,,
1,"Dec 18, 2009",Avatar,425000000.0,760507625.0,2.776345e+09
2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000.0,241063875.0,1.045664e+09
3,"Jun 7, 2019",Dark Phoenix,350000000.0,42762350.0,1.497624e+08
4,"May 1, 2015",Avengers: Age of Ultron,330600000.0,459005868.0,1.403014e+09
5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000.0,620181382.0,1.316722e+09

In [10]:
#dropping column
tn_movies.drop(["release_date"], axis = 1 , inplace = True)

In [11]:
# creating return investment column
tn_movies ["return_investment"]= ((tn_movies['domestic_gross'] + tn_movies['worldwide_gross'] - tn_movies['production_budget']) / tn_movies['production_budget']).round(2)

# Bom movies

In [12]:
bom_movie = pd.read_csv('ZippedData/bom.movie_gross.csv.gz')
bom_movie

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
...,...,...,...,...,...
3382,The Quake,Magn.,6200.0,NaN,2018
3383,Edward II (2018 re-release),FM,4800.0,NaN,2018
3384,El Pacto,Sony,2500.0,NaN,2018
3385,The Swan,Synergetic,2400.0,NaN,2018
3386,An Actor Prepares,Grav.,1700.0,NaN,2018

Data cleaning for the bom movies gross data shall also encompass identifying duplicates and missing values.

In [13]:
#importing bom gross data
bom_movies = pd.read_csv("ZippedData/bom.movie_gross.csv")

In [14]:
bom_movies.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [15]:
bom_movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

#### missing values

In [16]:
bom_movies.isna().sum()

title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

In [17]:
#identifying  duplicates
bom_movies.duplicated().sum()

0

In [18]:
# dropping foreign gross column
bom_movies.drop(["foreign_gross"], axis =1 , inplace = True)

In [19]:
bom_movies

,title,studio,domestic_gross,year
0,Toy Story 3,BV,415000000.0,2010
1,Alice in Wonderland (2010),BV,334200000.0,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,2010
3,Inception,WB,292600000.0,2010
4,Shrek Forever After,P/DW,238700000.0,2010
...,...,...,...,...
3382,The Quake,Magn.,6200.0,2018
3383,Edward II (2018 re-release),FM,4800.0,2018
3384,El Pacto,Sony,2500.0,2018
3385,The Swan,Synergetic,2400.0,2018
3386,An Actor Prepares,Grav.,1700.0,2018

In [20]:
# drop the rows that have missing studio values
bom_movies.dropna(subset =["studio"], axis = 0 , inplace = True)

In [21]:
# check presence of missing values
bom_movies.isna().sum()

title              0
studio             0
domestic_gross    26
year               0
dtype: int64

In [22]:
# eliminate rows that miss the domestic gross values
bom_movies.dropna(subset =["domestic_gross"], axis = 0 , inplace = True)

In [23]:
bom_movies.isna().sum()

title             0
studio            0
domestic_gross    0
year              0
dtype: int64

In [24]:
# changing the date format
bom_movies["year"] = pd.to_datetime(bom_movies["year"])

In [25]:
bom_movies.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3356 entries, 0 to 3386
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3356 non-null   object
 1   studio          3356 non-null   object
 2   domestic_gross  3356 non-null   float64
 3   year            3356 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(1), object(2)
memory usage: 131.1+ KB

# IMDB
We first define the connection

In [26]:
#defining conn
conn = sqlite3.connect('im.db')

In [27]:
imdb_data2 = pd.read_sql(""" select * from movie_basics""", conn)
imdb_data2

DatabaseError: Execution failed on sql ' select * from movie_basics': no such table: movie_basics